In [1]:
# Загружаем библиотеки
import numpy as np # работа с векторами
import matplotlib.pyplot as plt # рисовать графики
import pandas as pd # для работы с матрицами
import os as os #для смены директории

In [2]:
# Установим директорию для зарзгрузки данных для модели
os.chdir('C:/Users/Twentyouts/Desktop/Favorita')

In [3]:
#Changed the data-types in order to minimize the file-size
types = {
    'id': 'uint32',
    'item_nbr': 'uint32',
    'store_nbr': 'uint16',
    'unit_sales': 'float32',
    'onpromotion': bool,
}

In [4]:
# загружаем данные
train = pd.read_csv('train-000.csv', parse_dates=['date'], dtype=types, infer_datetime_format=True)
oil = pd.read_csv('oil.csv', parse_dates = ['date'],infer_datetime_format=True)

In [5]:
train.head()

   id       date  store_nbr  item_nbr  unit_sales onpromotion
0   0 2013-01-01         25    103665         7.0         NaN
1   1 2013-01-01         25    105574         1.0         NaN
2   2 2013-01-01         25    105575         2.0         NaN
3   3 2013-01-01         25    108079         1.0         NaN
4   4 2013-01-01         25    108701         1.0         NaN

In [6]:
train['begin'] = "2013-01-01"

In [7]:
stores = pd.read_csv('stores.csv')

In [8]:
stores.head()

   store_nbr           city                           state type  cluster
0          1          Quito                       Pichincha    D       13
1          2          Quito                       Pichincha    D       13
2          3          Quito                       Pichincha    D        8
3          4          Quito                       Pichincha    D        9
4          5  Santo Domingo  Santo Domingo de los Tsachilas    D        4

In [9]:
train.loc[:, "weekday"] = train["date"].dt.weekday.astype("uint16")
train.loc[:,"month"] = train["date"].dt.month.astype("uint16")
train.head()

,id,date,store_nbr,item_nbr,unit_sales,onpromotion,begin,weekday,month
0,0,2013-01-01,25,103665,7.0,NaN,2013-01-01,1,1
1,1,2013-01-01,25,105574,1.0,NaN,2013-01-01,1,1
2,2,2013-01-01,25,105575,2.0,NaN,2013-01-01,1,1
3,3,2013-01-01,25,108079,1.0,NaN,2013-01-01,1,1
4,4,2013-01-01,25,108701,1.0,NaN,2013-01-01,1,1

In [10]:
train = pd.merge(train, oil, how ='left', left_on ='date', right_on = 'date',copy = True, left_index = False, right_index = False,
               sort = True)

In [11]:
train.tail(5)

,id,date,store_nbr,item_nbr,unit_sales,onpromotion,begin,weekday,month,dcoilwtico
15999995,15999995,2013-12-24,43,407500,6.0,NaN,2013-01-01,1,12,98.87
15999996,15999996,2013-12-24,43,407542,5.0,NaN,2013-01-01,1,12,98.87
15999997,15999997,2013-12-24,43,409738,2.0,NaN,2013-01-01,1,12,98.87
15999998,15999998,2013-12-24,43,409904,3.0,NaN,2013-01-01,1,12,98.87
15999999,15999999,2013-12-24,43,410257,6.0,NaN,2013-01-01,1,12,98.87

In [12]:
test = pd.read_csv('test.csv', parse_dates=['date'], dtype=types, infer_datetime_format=True)
test.loc[:, "weekday"] = test["date"].dt.weekday.astype("uint16")
test.loc[:,"month"] = test["date"].dt.month.astype("uint16")
test.head()

          id       date  store_nbr  item_nbr  onpromotion  weekday  month
0  125497040 2017-08-16          1     96995        False        2      8
1  125497041 2017-08-16          1     99197        False        2      8
2  125497042 2017-08-16          1    103501        False        2      8
3  125497043 2017-08-16          1    103520        False        2      8
4  125497044 2017-08-16          1    103665        False        2      8

In [13]:
test = pd.merge(test, oil, how ='left', left_on ='date', right_on = 'date',copy = True, left_index = False, right_index = False,
               sort = True)
test.head()

,id,date,store_nbr,item_nbr,onpromotion,weekday,month,dcoilwtico
0,125497040,2017-08-16,1,96995,False,2,8,46.8
1,125497041,2017-08-16,1,99197,False,2,8,46.8
2,125497042,2017-08-16,1,103501,False,2,8,46.8
3,125497043,2017-08-16,1,103520,False,2,8,46.8
4,125497044,2017-08-16,1,103665,False,2,8,46.8

In [14]:
train = pd.merge(train, stores, how = 'left', left_on = 'store_nbr', right_on = 'store_nbr', copy = True, left_index = False, 
                right_index = False, sort = True)
test = pd.merge(test, stores, how = 'left', left_on = 'store_nbr', right_on = 'store_nbr', copy = True, left_index = False, 
                right_index = False, sort = True)

In [15]:
train['onpromotion'] = train['onpromotion'].fillna(False)
test['onpromotion'] = test['onpromotion'].fillna(False)

In [16]:
train.head()

,id,date,store_nbr,item_nbr,unit_sales,onpromotion,begin,weekday,month,dcoilwtico,city,state,type,cluster
0,578,2013-01-02,1,103665,2.0,False,2013-01-01,2,1,93.14,Quito,Pichincha,D,13
1,579,2013-01-02,1,105574,8.0,False,2013-01-01,2,1,93.14,Quito,Pichincha,D,13
2,580,2013-01-02,1,105575,15.0,False,2013-01-01,2,1,93.14,Quito,Pichincha,D,13
3,581,2013-01-02,1,105577,2.0,False,2013-01-01,2,1,93.14,Quito,Pichincha,D,13
4,582,2013-01-02,1,105737,2.0,False,2013-01-01,2,1,93.14,Quito,Pichincha,D,13

In [17]:
from sklearn import preprocessing
def encode_features(train, test):
    features=["month"]
    df_combined = pd.concat([train[features], test[features]])
    
    for feature in features:
        le = preprocessing.LabelEncoder()
        le = le.fit(df_combined[features])
        train[feature] = le.transform(train[feature])
        test[feature] = le.transform(test[feature])
    return train,test
train, test = encode_features(train,test)
train.head()

C:\Users\Twentyouts\Anaconda3\lib\site-packages\sklearn\preprocessing\label.py:95: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

,id,date,store_nbr,item_nbr,unit_sales,onpromotion,begin,weekday,month,dcoilwtico,city,state,type,cluster
0,578,2013-01-02,1,103665,2.0,False,2013-01-01,2,0,93.14,Quito,Pichincha,D,13
1,579,2013-01-02,1,105574,8.0,False,2013-01-01,2,0,93.14,Quito,Pichincha,D,13
2,580,2013-01-02,1,105575,15.0,False,2013-01-01,2,0,93.14,Quito,Pichincha,D,13
3,581,2013-01-02,1,105577,2.0,False,2013-01-01,2,0,93.14,Quito,Pichincha,D,13
4,582,2013-01-02,1,105737,2.0,False,2013-01-01,2,0,93.14,Quito,Pichincha,D,13

In [18]:
def encode_features(train, test):
    features=["onpromotion"]
    df_combined = pd.concat([train[features], test[features]])
    
    for feature in features:
        le = preprocessing.LabelEncoder()
        le = le.fit(df_combined[features])
        train[feature] = le.transform(train[feature])
        test[feature] = le.transform(test[feature])
    return train,test
train, test = encode_features(train,test)
train.head()

C:\Users\Twentyouts\Anaconda3\lib\site-packages\sklearn\preprocessing\label.py:95: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

,id,date,store_nbr,item_nbr,unit_sales,onpromotion,begin,weekday,month,dcoilwtico,city,state,type,cluster
0,578,2013-01-02,1,103665,2.0,0,2013-01-01,2,0,93.14,Quito,Pichincha,D,13
1,579,2013-01-02,1,105574,8.0,0,2013-01-01,2,0,93.14,Quito,Pichincha,D,13
2,580,2013-01-02,1,105575,15.0,0,2013-01-01,2,0,93.14,Quito,Pichincha,D,13
3,581,2013-01-02,1,105577,2.0,0,2013-01-01,2,0,93.14,Quito,Pichincha,D,13
4,582,2013-01-02,1,105737,2.0,0,2013-01-01,2,0,93.14,Quito,Pichincha,D,13

In [19]:
def encode_features(train, test):
    features=["city"]
    df_combined = pd.concat([train[features], test[features]])
    
    for feature in features:
        le = preprocessing.LabelEncoder()
        le = le.fit(df_combined[features])
        train[feature] = le.transform(train[feature])
        test[feature] = le.transform(test[feature])
    return train,test
train, test = encode_features(train,test)
train.head()

C:\Users\Twentyouts\Anaconda3\lib\site-packages\sklearn\preprocessing\label.py:95: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

,id,date,store_nbr,item_nbr,unit_sales,onpromotion,begin,weekday,month,dcoilwtico,city,state,type,cluster
0,578,2013-01-02,1,103665,2.0,0,2013-01-01,2,0,93.14,18,Pichincha,D,13
1,579,2013-01-02,1,105574,8.0,0,2013-01-01,2,0,93.14,18,Pichincha,D,13
2,580,2013-01-02,1,105575,15.0,0,2013-01-01,2,0,93.14,18,Pichincha,D,13
3,581,2013-01-02,1,105577,2.0,0,2013-01-01,2,0,93.14,18,Pichincha,D,13
4,582,2013-01-02,1,105737,2.0,0,2013-01-01,2,0,93.14,18,Pichincha,D,13

In [20]:
def encode_features(train, test):
    features=["state"]
    df_combined = pd.concat([train[features], test[features]])
    
    for feature in features:
        le = preprocessing.LabelEncoder()
        le = le.fit(df_combined[features])
        train[feature] = le.transform(train[feature])
        test[feature] = le.transform(test[feature])
    return train,test
train, test = encode_features(train,test)
train.head()

C:\Users\Twentyouts\Anaconda3\lib\site-packages\sklearn\preprocessing\label.py:95: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

,id,date,store_nbr,item_nbr,unit_sales,onpromotion,begin,weekday,month,dcoilwtico,city,state,type,cluster
0,578,2013-01-02,1,103665,2.0,0,2013-01-01,2,0,93.14,18,12,D,13
1,579,2013-01-02,1,105574,8.0,0,2013-01-01,2,0,93.14,18,12,D,13
2,580,2013-01-02,1,105575,15.0,0,2013-01-01,2,0,93.14,18,12,D,13
3,581,2013-01-02,1,105577,2.0,0,2013-01-01,2,0,93.14,18,12,D,13
4,582,2013-01-02,1,105737,2.0,0,2013-01-01,2,0,93.14,18,12,D,13

In [21]:
def encode_features(train, test):
    features=["type"]
    df_combined = pd.concat([train[features], test[features]])
    
    for feature in features:
        le = preprocessing.LabelEncoder()
        le = le.fit(df_combined[features])
        train[feature] = le.transform(train[feature])
        test[feature] = le.transform(test[feature])
    return train,test
train, test = encode_features(train,test)
train.head()

C:\Users\Twentyouts\Anaconda3\lib\site-packages\sklearn\preprocessing\label.py:95: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

,id,date,store_nbr,item_nbr,unit_sales,onpromotion,begin,weekday,month,dcoilwtico,city,state,type,cluster
0,578,2013-01-02,1,103665,2.0,0,2013-01-01,2,0,93.14,18,12,3,13
1,579,2013-01-02,1,105574,8.0,0,2013-01-01,2,0,93.14,18,12,3,13
2,580,2013-01-02,1,105575,15.0,0,2013-01-01,2,0,93.14,18,12,3,13
3,581,2013-01-02,1,105577,2.0,0,2013-01-01,2,0,93.14,18,12,3,13
4,582,2013-01-02,1,105737,2.0,0,2013-01-01,2,0,93.14,18,12,3,13

In [22]:
test["dcoilwtico"] = test["dcoilwtico"].fillna(test["dcoilwtico"].median())

In [23]:
train["dcoilwtico"] = train["dcoilwtico"].fillna(train["dcoilwtico"].median())

In [24]:
from sklearn.model_selection import train_test_split
X = train.drop(['id','date','unit_sales','begin'], axis = 1)
y = train['unit_sales']

num_test = 0.20
X_train, X_test, y_train, y_test = train_test_split(X,y, test_size = num_test, random_state = 23)

In [25]:
from sklearn.ensemble import RandomForestRegressor
regressor = RandomForestRegressor(max_depth = 6, n_estimators = 5, random_state = 0)

In [30]:
regressor.fit(X,y)

RandomForestRegressor(bootstrap=True, criterion='mse', max_depth=6,
           max_features='auto', max_leaf_nodes=None,
           min_impurity_decrease=0.0, min_impurity_split=None,
           min_samples_leaf=1, min_samples_split=2,
           min_weight_fraction_leaf=0.0, n_estimators=5, n_jobs=1,
           oob_score=False, random_state=0, verbose=0, warm_start=False)

In [31]:
test_ = test.drop(['id','date'], axis=1)

In [32]:
test_.head()

,store_nbr,item_nbr,onpromotion,weekday,month,dcoilwtico,city,state,type,cluster
0,1,96995,0,2,7,46.8,18,12,3,13
1,1,99197,0,2,7,46.8,18,12,3,13
2,1,103501,0,2,7,46.8,18,12,3,13
3,1,103520,0,2,7,46.8,18,12,3,13
4,1,103665,0,2,7,46.8,18,12,3,13

In [33]:
y_pred = regressor.predict(test_)

In [34]:
test['unit_sales'] = y_pred
test.head()

,id,date,store_nbr,item_nbr,onpromotion,weekday,month,dcoilwtico,city,state,type,cluster,unit_sales
0,125497040,2017-08-16,1,96995,0,2,7,46.8,18,12,3,13,6.334355
1,125497041,2017-08-16,1,99197,0,2,7,46.8,18,12,3,13,6.334355
2,125497042,2017-08-16,1,103501,0,2,7,46.8,18,12,3,13,6.334355
3,125497043,2017-08-16,1,103520,0,2,7,46.8,18,12,3,13,6.334355
4,125497044,2017-08-16,1,103665,0,2,7,46.8,18,12,3,13,6.334355

In [35]:
test = test[['id','unit_sales']]

In [36]:
test.to_csv("final.csv", sep=',',index = False)

In [30]:
from sklearn.ensemble import RandomForestRegressor
from sklearn.metrics import make_scorer,mean_squared_error
from sklearn.model_selection import GridSearchCV

In [26]:
#choose regressor type
regressor = RandomForestRegressor()

In [27]:
#choose parametres to start on
parameters = {'n_estimators': [4,6,9],
              'criterion':['mse','mae'],
              'max_features':['log2','sqrt','auto'],
              'max_depth':[2,4,6,8],
              'min_samples_split':[2,4,6],
              'min_samples_leaf': [1,2,3]
             }

In [ ]:
#type of scoring to compare combinations
log_error = make_scorer(mean_squared_error)

#run the grid search
grid_obj = GridSearchCV(regressor, parameters, scoring = log_error)
grid_obj = grid_obj.fit(X_train,y_train)